# ScheduleMark Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarInSystem..::..ScheduleMark Property
RebarInSystem Class See Also
---
The Schedule Mark parameter. On creation, the Schedule Mark is set to a value that is unique to the host, but it can be set to any value.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string ScheduleMark { get; set; }
```

Visual Basic
---
```text
Public Property ScheduleMark As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ ScheduleMark {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace